probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
    /* Mode button hold tracking (for SEQ_MODE_BOTH) */
    bool drums_btn_held;
    bool keys_btn_held;

    /* Thread safety */
    portMUX_TYPE mux;
} seq_state_t;

static seq_state_t s_seq;

/* Live "hold while pressed" state for the lower half of Circle mode (rows 5-8).
 * We track the exact MIDI notes that were turned on so release sends precise note-offs. */
static struct {
    uint8_t notes[12];
    int     note_count;
} s_circle_lower_hold = {};

/* Per-raw-note remap table for external MIDI in FIELD mode.
 * Stores the quantized note that was actually started for each incoming note,
 * so note-offs are always sent to the correct playing voice even if the
 * harmonic state changes between press and release. */
static uint8_t s_field_note_map[128] = {};

/* Returns true if `note` is currently pressed by the user (Launchpad FIELD pad
 * or external MIDI keyboard).  Any MIDI note-off guarded by this check will
 * be skipped so that automatic chord transitions never cut a user-held note.
 * In non-FIELD mode the remap table stores raw→raw for keyboard notes, so
 * keyboard notes remain visible regardless of the current sequencer mode. */
static bool is_user_held(uint8_t note)
{
    /* Launchpad FIELD pad notes */
    for (int i = 0; i < 64; i++) {
        if (s_seq.field_notes[i].active && s_seq.field_notes[i].note == note)
            return true;
    }
    /* External MIDI keyboard notes (values in the remap table) */
    for (int i = 0; i < 128; i++) {
        if (s_field_note_map[i] != 0 && s_field_note_map[i] == note)
            return true;
    }
    return false;
}

/* ================================================
 * Timer helpers
 * ================================================ */

static uint64_t step_period_us(uint16_t bpm)
{
    /* 16th note period = 60,000,000 / (bpm * 4) microseconds */
    return 60000000ULL / ((uint64_t)bpm * 4);
}

/* ================================================
 * MIDI routing: drums → TSF when loaded, else Dexed
 * ================================================ */

/* Channel marker: active_notes[].channel == 9 means the note was sent to TSF. */
#define SEQ_CH_TSF  9
#define SEQ_CH_DEX  0

static inline void seq_drum_note_on(uint8_t note, uint8_t vel)
{
    if (tsf_engine_is_loaded()) {
        tsf_engine_handle_midi(0x99, note, vel);  /* channel 9 */
    } else {
        dexed_raw_handle_midi(0x90, note, vel);
    }
}

static inline void seq_drum_note_off(uint8_t note)
{
    if (tsf_engine_is_loaded()) {
        tsf_engine_handle_midi(0x89, note, 0);
    } else {
        dexed_raw_handle_midi(0x80, note, 0);
    }
}

/* Send Note Off to the correct engine based on stored channel marker. */
static inline void seq_note_off_routed(uint8_t channel, uint8_t note)
{
    if (channel == SEQ_CH_TSF) {
        tsf_engine_handle_midi(0x89, note, 0);
    } else {
        dexed_raw_handle_midi((uint8_t)(0x80 | channel), note, 0);
    }
}

/* ================================================
 * Timer callback -- called from esp_timer task (Core 0)
 * ================================================ */

static void seq_timer_callback(void *arg)
{
    seq_state_t *s = (seq_state_t *)arg;

    portENTER_CRITICAL(&s->mux);

    /* 1. Note Off for all currently sounding step notes (NOT bar chord notes) */
    for (int i = 0; i < s->active_note_count; i++) {
        seq_note_off_routed(s->active_notes[i].channel, s->active_notes[i].note);
    }
    s->active_note_count = 0;

    /* 2. Advance playhead */
    s->current_step = (s->current_step + 1) % s->num_steps;
    int step = s->current_step;

    /* 3. At each quarter-note boundary (every 4 steps): advance chord sequencer or bar chord */
    if (step % 4 == 0 && s->playing) {
        /* Advance chord-seq playhead independently (0-31 over 4 drum loops) */
        s->chord_seq_step = (s->chord_seq_step < 0) ? 0 : (s->chord_seq_step + 1) % 32;
        int q = s->chord_seq_step;

        /* Check whether the chord step sequencer has any programmed steps */
        bool chord_seq_has_steps = false;
        for (int i = 0; i < 32; i++) {
            if (s->chord_seq_steps[i].active) { chord_seq_has_steps = true; break; }
        }

        uint8_t play_root = 0xFF;   /* 0xFF = no chord this quarter */
        chord_type_t play_type = CHORD_MAJ;

        if (chord_seq_has_steps) {
            if (s->chord_seq_steps[q].active) {
                play_root = s->chord_seq_steps[q].chord_root;
                play_type = s->chord_seq_steps[q].chord_type;
            }
        } else if (step == 0 && s->held_chord.active) {
            /* Legacy: held chord fires once per 2-bar loop (only when no chord seq programmed) */
            play_root = s->held_chord.chord_root;
            play_type = s->held_chord.chord_type;
        }

        /* At every quarter boundary that belongs to the chord sequencer, stop the previous
         * chord ONLY when a new chord is about to play — this gives legato sustain across
         * empty steps so chords ring until the next programmed step. */
        if (!chord_seq_has_steps && step == 0 && s->held_chord.active) {
            /* Legacy: held chord fires once per 2-bar loop */
            play_root = s->held_chord.chord_root;
            play_type = s->held_chord.chord_type;
        }

        if (play_root != 0xFF) {
            /* Stop previous bar chord notes now that a new one is starting */
            for (int i = 0; i < s->bar_chord_note_count; i++) {
                if (s->bar_chord_notes[i].active) {
                    if (!is_user_held(s->bar_chord_notes[i].note))
                        dexed_raw_handle_midi(0x80, s->bar_chord_notes[i].note, 0);
                    s->bar_chord_notes[i].active = false;
                }
            }
            s->bar_chord_note_count = 0;
            /* Update harmonic state so FIELD page + suggestion engine reflect the new chord */
            uint8_t abs_old = (s->harmonic.key + s->harmonic.chord_root) % 12;
            s->harmonic.prev_chord_root = abs_old;
            s->harmonic.prev_chord_type = s->harmonic.chord_type;
            s->harmonic.has_prev_chord  = true;
            s->harmonic.chord_root = (play_root - s->harmonic.key + 12) % 12;
            s->harmonic.chord_type = play_type;

            /* Keep held_chord in sync so the Circle display stays coherent */
            if (chord_seq_has_steps) {
                s->held_chord.chord_root = play_root;
                s->held_chord.chord_type = play_type;
                s->held_chord.active     = true;
            }

