probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

void step_seq_toggle_play(void)
{
    if (s_seq.playing) {
        step_seq_stop();
    } else {
        step_seq_play();
    }
}

bool step_seq_is_playing(void)
{
    return s_seq.playing;
}

/* ================================================
 * Mode
 * ================================================ */

void step_seq_set_mode(seq_mode_t mode)
{
    s_seq.mode = mode;
    
    static const char* mode_names[] = {
        "DRUM", "MELODIC", "BOTH", "CIRCLE", "FIELD"
    };
    ESP_LOGI(TAG, "Mode: %s", mode_names[mode]);
    esp32_oled_show_mode((int)mode);

    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

seq_mode_t step_seq_get_mode(void)
{
    return s_seq.mode;
}

/* ================================================
 * BPM
 * ================================================ */

void step_seq_set_bpm(uint16_t bpm)
{
    if (bpm < SEQ_MIN_BPM) bpm = SEQ_MIN_BPM;
    if (bpm > SEQ_MAX_BPM) bpm = SEQ_MAX_BPM;
    s_seq.bpm = bpm;

    if (s_seq.playing) {
        esp_timer_restart(s_seq.timer, step_period_us(bpm));
    }
    ESP_LOGI(TAG, "BPM: %d", bpm);
    esp32_oled_show_bpm(bpm);
}

void step_seq_adjust_bpm(int16_t delta)
{
    int new_bpm = (int)s_seq.bpm + delta;
    step_seq_set_bpm((uint16_t)(new_bpm < SEQ_MIN_BPM ? SEQ_MIN_BPM :
                                 (new_bpm > SEQ_MAX_BPM ? SEQ_MAX_BPM : new_bpm)));
}

uint16_t step_seq_get_bpm(void)
{
    return s_seq.bpm;
}

/* ================================================
 * Drum mode operations
 * ================================================ */

void step_seq_select_drum(uint8_t drum_index)
{
    if (drum_index >= SEQ_NUM_DRUM_TRACKS) return;
    s_seq.selected_drum = drum_index;
}

uint8_t step_seq_get_selected_drum(void)
{
    return s_seq.selected_drum;
}

void step_seq_drum_toggle_step(uint8_t step)
{
    if (step >= SEQ_MAX_STEPS) return;
    portENTER_CRITICAL(&s_seq.mux);
    uint8_t *vel = &s_seq.drum_tracks[s_seq.selected_drum].steps[step].velocity;
    if (*vel > 0) {
        *vel = 0;
    } else {
        *vel = s_seq.current_velocity;
    }
    portEXIT_CRITICAL(&s_seq.mux);
}

void step_seq_drum_set_step(uint8_t step, uint8_t velocity)
{
    if (step >= SEQ_MAX_STEPS) return;
    portENTER_CRITICAL(&s_seq.mux);
    s_seq.drum_tracks[s_seq.selected_drum].steps[step].velocity = velocity;
    portEXIT_CRITICAL(&s_seq.mux);
}

void step_seq_drum_clear_step(uint8_t step)
{
    step_seq_drum_set_step(step, 0);
}

/* ================================================
 * Velocity
 * ================================================ */

void step_seq_set_velocity(uint8_t velocity)
{
    if (velocity < 1) velocity = 1;
    if (velocity > 127) velocity = 127;
    s_seq.current_velocity = velocity;
    ESP_LOGD(TAG, "Velocity: %d", velocity);
}

uint8_t step_seq_get_velocity(void)
{
    return s_seq.current_velocity;
}

/* ================================================
 * Melodic mode operations
 * ================================================ */

void step_seq_melodic_toggle_note(uint8_t step, uint8_t midi_note, uint8_t velocity)
{
    if (step >= SEQ_MAX_STEPS) return;
    portENTER_CRITICAL(&s_seq.mux);
    seq_melodic_step_t *ms = &s_seq.melodic_steps[step];

    /* Check if note already exists in this step */
    for (int i = 0; i < ms->note_count; i++) {
        if (ms->notes[i] == midi_note) {
            /* Remove it (shift down) */
            for (int j = i; j < ms->note_count - 1; j++) {
                ms->notes[j] = ms->notes[j + 1];
                ms->velocities[j] = ms->velocities[j + 1];
            }
            ms->note_count--;
            portEXIT_CRITICAL(&s_seq.mux);
            return;
        }
    }

    /* Add note if space available */
    if (ms->note_count < SEQ_MAX_NOTES_PER_STEP) {
        ms->notes[ms->note_count] = midi_note;
        ms->velocities[ms->note_count] = velocity;
        ms->note_count++;
    }
    portEXIT_CRITICAL(&s_seq.mux);
}

void step_seq_melodic_clear_step(uint8_t step)
{
    if (step >= SEQ_MAX_STEPS) return;
    portENTER_CRITICAL(&s_seq.mux);
    s_seq.melodic_steps[step].note_count = 0;
    portEXIT_CRITICAL(&s_seq.mux);
}

void step_seq_set_base_octave(uint8_t octave)
{
    if (octave > 8) octave = 8;
    s_seq.base_octave = octave;
    esp32_oled_show_octave(octave);
}

uint8_t step_seq_get_base_octave(void)
{
    return s_seq.base_octave;
}

/* ================================================
 * Page navigation
 * ================================================ */

void step_seq_page_left(void)
{
    if (s_seq.page > 0) s_seq.page--;
}

void step_seq_page_right(void)
{
    s_seq.page++;
}

uint8_t step_seq_get_page(void)
{
    return s_seq.page;
}

/* ================================================
 * Harmonic State API
 * ================================================ */

void step_seq_set_key(uint8_t key)
{
    if (key >= 12) key = 0;
    s_seq.harmonic.key = key;
    ESP_LOGI(TAG, "Key: %s", note_names[key]);
    esp32_oled_show_key(key);
}

uint8_t step_seq_get_key(void)
{
    return s_seq.harmonic.key;
}

void step_seq_set_chord(uint8_t root, chord_type_t type)
{
    if (root >= 12) root = 0;
    if (type >= CHORD_TYPE_COUNT) type = CHORD_MAJ;
    s_seq.harmonic.chord_root = root;
    s_seq.harmonic.chord_type = type;
    
    uint8_t abs_root = (s_seq.harmonic.key + root) % 12;
    char roman[8] = {0};
    step_seq_chord_roman_numeral(root, type, s_seq.harmonic.scale_type, roman, sizeof(roman));
    ESP_LOGI(TAG, "Chord: %s (%s%s)", roman, note_names[abs_root], chord_type_names[type]);
}

uint8_t step_seq_get_chord_root(void)
{
    return s_seq.harmonic.chord_root;
}

chord_type_t step_seq_get_chord_type(void)
{
    return s_seq.harmonic.chord_type;
}

void step_seq_set_scale(scale_type_t scale)
{
    if (scale >= SCALE_TYPE_COUNT) scale = SCALE_MAJOR;
    s_seq.harmonic.scale_type = scale;
    ESP_LOGI(TAG, "Scale type: %d", scale);
    esp32_oled_show_scale((int)scale);
}

scale_type_t step_seq_get_scale(void)
{
    return s_seq.harmonic.scale_type;
}

void step_seq_set_tension(uint8_t tension)
{
    if (tension > 3) tension = 3;
    s_seq.harmonic.tension = tension;
    ESP_LOGI(TAG, "Tension: %d", tension);
    esp32_oled_show_tension(tension);
}

uint8_t step_seq_get_tension(void)
{
    return s_seq.harmonic.tension;
}

const harmonic_state_t* step_seq_get_harmonic_state(void)
{
    return &s_seq.harmonic;
}

/* ================================================
 * Harmonic Mode Helper Functions
 * ================================================ */

/* Get circle of fifths distance between two notes (0-6) */
static int circle_distance(uint8_t note_a, uint8_t note_b)
{
    int pos_a = semitone_to_circle[note_a % 12];
    int pos_b = semitone_to_circle[note_b % 12];
    int dist = abs(pos_a - pos_b);
    return (dist > 6) ? (12 - dist) : dist;
}

/* Check if a pitch class is a chord tone */
static bool is_chord_tone(uint8_t pitch_class, uint8_t chord_root, chord_type_t chord_type)
{
    int relative = ((int)pitch_class - (int)chord_root + 12) % 12;
    return (chord_masks[chord_type] >> relative) & 1;
}

/* Check if a pitch class is in the scale */
static bool is_scale_tone(uint8_t pitch_class, uint8_t key, scale_type_t scale_type)
{
    int relative = ((int)pitch_class - (int)key + 12) % 12;
    return (scale_masks[scale_type] >> relative) & 1;
}

/* ---- Scale degree extraction ----
 * Returns the MIDI note for scale degree `degree` (0-based) at given octave.
 * degree 0 = root, degree 1 = 2nd, ... degree 6 = 7th.
 * Returns the semitone offset from the key root for each degree.
 */
static const uint8_t major_degrees[7]    = {0, 2, 4, 5, 7, 9, 11};
static const uint8_t minor_degrees[7]    = {0, 2, 3, 5, 7, 8, 10};
static const uint8_t dorian_degrees[7]   = {0, 2, 3, 5, 7, 9, 10};
static const uint8_t mixolyd_degrees[7]  = {0, 2, 4, 5, 7, 9, 10};
static const uint8_t phrygian_degrees[7] = {0, 1, 3, 5, 7, 8, 10};
static const uint8_t lydian_degrees[7]   = {0, 2, 4, 6, 7, 9, 11};
static const uint8_t locrian_degrees[7]  = {0, 1, 3, 5, 6, 8, 10};
/* Pentatonic: only 5 notes — pad columns 6-7 with passing tones */
static const uint8_t penta_maj_degrees[7] = {0, 2, 4, 7, 9, 12, 14};
static const uint8_t penta_min_degrees[7] = {0, 3, 5, 7, 10, 12, 15};

static const uint8_t* get_scale_degrees(scale_type_t st)
{
    switch (st) {
        case SCALE_MAJOR:           return major_degrees;
        case SCALE_MINOR:           return minor_degrees;
        case SCALE_DORIAN:          return dorian_degrees;
        case SCALE_MIXOLYDIAN:      return mixolyd_degrees;
        case SCALE_PHRYGIAN:        return phrygian_degrees;
        case SCALE_LYDIAN:          return lydian_degrees;
        case SCALE_LOCRIAN:         return locrian_degrees;
        case SCALE_PENTATONIC_MAJ:  return penta_maj_degrees;
        case SCALE_PENTATONIC_MIN:  return penta_min_degrees;
        default:                    return major_degrees;
    }
}

