probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
/* Q1/Q2 pad → step index (Drum mode) */
static int grid_to_step_index(uint8_t row, uint8_t col)
{
    if (row < 5 || row > 8 || col < 1 || col > 8) return -1;
    return (8 - row) * 8 + (col - 1);
}

/* Q3 pad → drum index */
static int q3_to_drum_index(uint8_t row, uint8_t col)
{
    if (row < 1 || row > 4 || col < 1 || col > 4) return -1;
    return (row - 1) * 4 + (col - 1);
}

/* Q4 pad → velocity index */
static int q4_to_velocity_index(uint8_t row, uint8_t col)
{
    if (row < 1 || row > 4 || col < 5 || col > 8) return -1;
    return (row - 1) * 4 + (col - 5);
}

/* Velocity levels for Q4 */
static const uint8_t velocity_levels[16] = {
    8, 16, 24, 32, 40, 48, 56, 64,
    72, 80, 88, 96, 104, 112, 120, 127
};

/* ================================================
 * Input handlers (called from launchpad.cpp)
 * ================================================ */

void step_seq_handle_grid_press(uint8_t row, uint8_t col, uint8_t velocity)
{
    if (s_seq.mode == SEQ_MODE_DRUM || s_seq.mode == SEQ_MODE_BOTH) {
        if (lp_is_q1(row, col) || lp_is_q2(row, col)) {
            /* Step grid: toggle step for selected drum */
            int step = grid_to_step_index(row, col);
            if (step >= 0 && step < s_seq.num_steps) {
                step_seq_drum_toggle_step((uint8_t)step);
            }
        }
        else if (lp_is_q3(row, col)) {
            /* Drum pad selection + audition.
             * On pressure-sensitive pads (Launchpad X) adopt the actual played
             * velocity as the new current velocity so the next programmed step
             * uses it too.  A pad reporting exactly 64 is almost certainly a
             * fixed-velocity device — keep the existing velocity in that case. */
            int drum = q3_to_drum_index(row, col);
            if (drum >= 0 && drum < SEQ_NUM_DRUM_TRACKS) {
                step_seq_select_drum((uint8_t)drum);
                uint8_t v = (velocity > 0 && velocity != 64)
                            ? velocity
                            : s_seq.current_velocity;
                if (v != s_seq.current_velocity) step_seq_set_velocity(v);
                /* Audition: trigger the drum sound at played velocity */
                seq_drum_note_on(drum_midi_notes[drum], v);
            }
        }
        else if (lp_is_q4(row, col)) {
            /* Velocity selection grid — fixed preset levels per cell */
            int vel_idx = q4_to_velocity_index(row, col);
            if (vel_idx >= 0 && vel_idx < 16) {
                step_seq_set_velocity(velocity_levels[vel_idx]);
            }
        }
    }
    else if (s_seq.mode == SEQ_MODE_MELODIC) {
        if (lp_is_q1(row, col) || lp_is_q2(row, col)) {
            /* Melodic step grid: columns=time, rows=pitch */
            int step = (col - 1);  /* 0-7 */
            uint8_t pitch = (uint8_t)(s_seq.base_octave * 12 + (row - 5));
            step_seq_melodic_toggle_note((uint8_t)step, pitch, s_seq.current_velocity);
        }
        else if (lp_is_q3(row, col) || lp_is_q4(row, col)) {
            /* Keyboard: play note live */
            uint8_t base = s_seq.base_octave * 12;
            int offset;
            if (col <= 4) {
                offset = (row - 1) * 4 + (col - 1);
            } else {
                offset = 16 + (row - 1) * 4 + (col - 5);
            }
            uint8_t note = (uint8_t)(base + offset);
            if (note <= 127) {
                dexed_raw_handle_midi(0x90, note, velocity);
            }
        }
    }
    else if (s_seq.mode == SEQ_MODE_CIRCLE) {
        /* Circle of Fifths chord mode - rows 1-4 only (rows 5-8 are dark/unused) */
        if (lp_is_grid(row, col) && row <= 4) {
            uint8_t chord_root;
            chord_type_t chord_type;
            get_circle_chord(row, col, s_seq.harmonic.key, &chord_root, &chord_type);

            /* Stop any previously held notes — but never cut a user-held note */
            for (int i = 0; i < s_circle_lower_hold.note_count; i++)
                if (!is_user_held(s_circle_lower_hold.notes[i]))
                    dexed_raw_handle_midi(0x80, s_circle_lower_hold.notes[i], 0);
            s_circle_lower_hold.note_count = 0;
            /* Also clear bar-chord notes fired by the timer */
            portENTER_CRITICAL(&s_seq.mux);
            for (int i = 0; i < s_seq.bar_chord_note_count; i++) {
                if (s_seq.bar_chord_notes[i].active) {
                    if (!is_user_held(s_seq.bar_chord_notes[i].note))
                        dexed_raw_handle_midi(0x80, s_seq.bar_chord_notes[i].note, 0);
                    s_seq.bar_chord_notes[i].active = false;
                }
            }
            s_seq.bar_chord_note_count = 0;
            portEXIT_CRITICAL(&s_seq.mux);

            /* Save previous chord for suggestion engine */
            uint8_t abs_old = (s_seq.harmonic.key + s_seq.harmonic.chord_root) % 12;
            s_seq.harmonic.prev_chord_root = abs_old;
            s_seq.harmonic.prev_chord_type = s_seq.harmonic.chord_type;
            s_seq.harmonic.has_prev_chord = true;

            /* Update harmonic state to new chord */
            s_seq.harmonic.chord_root = (chord_root - s_seq.harmonic.key + 12) % 12;
            s_seq.harmonic.chord_type = chord_type;

            /* Track last manually-selected chord for step assignment */
            s_seq.selected_chord_root = chord_root;
            s_seq.selected_chord_type = chord_type;
            s_seq.has_selected_chord  = true;

            /* Play and record exact notes — stopped precisely on pad release */
            uint16_t mask = chord_masks[chord_type];
            uint8_t base_note = (uint8_t)((s_seq.base_octave + 3) * 12 + chord_root);
            for (int i = 0; i < 12; i++) {
                if ((mask >> i) & 1) {
                    uint8_t n = base_note + i;
                    if (n <= 127 && s_circle_lower_hold.note_count < 12) {
                        dexed_raw_handle_midi(0x90, n, velocity);
                        s_circle_lower_hold.notes[s_circle_lower_hold.note_count++] = n;
                    }
                }
            }

            ESP_LOGI(TAG, "Circle: %s%s (hold-while-pressed) (prev %s)",
                     note_names[chord_root], chord_type_names[chord_type],
                     s_seq.harmonic.has_prev_chord ? note_names[abs_old] : "none");
        }
        else if (lp_is_grid(row, col) && row >= 5) {
            /* Chord step sequencer: rows 5-8, cols 1-8 → steps 0-31
             * same layout as drum grid: row 8 = steps 0-7, row 7 = 8-15,
             * row 6 = 16-23, row 5 = 24-31 */
            int seq_step = (8 - row) * 8 + (col - 1);  /* 0-31 */
            if (seq_step >= 0 && seq_step < 32 && s_seq.has_selected_chord) {
                bool cleared = false;
                portENTER_CRITICAL(&s_seq.mux);
                if (s_seq.chord_seq_steps[seq_step].active &&
                    s_seq.chord_seq_steps[seq_step].chord_root == s_seq.selected_chord_root &&
                    s_seq.chord_seq_steps[seq_step].chord_type == s_seq.selected_chord_type) {
                    /* Same chord already on this step → clear it */
                    s_seq.chord_seq_steps[seq_step].active = false;
                    cleared = true;
                } else {
                    /* Different or empty → assign last manually-selected chord */
                    s_seq.chord_seq_steps[seq_step].chord_root = s_seq.selected_chord_root;
                    s_seq.chord_seq_steps[seq_step].chord_type = s_seq.selected_chord_type;
                    s_seq.chord_seq_steps[seq_step].active = true;
                }
                portEXIT_CRITICAL(&s_seq.mux);
                if (cleared) {
                    ESP_LOGI(TAG, "ChordSeq step %d cleared", seq_step);
                } else {
                    char _roman[8] = {0};
                    step_seq_chord_roman_numeral(s_seq.selected_chord_root,
                        s_seq.selected_chord_type, s_seq.harmonic.scale_type,
                        _roman, sizeof(_roman));
                    ESP_LOGI(TAG, "ChordSeq step %d: %s (%s%s)", seq_step,
                             _roman,
                             note_names[s_seq.selected_chord_root],
                             chord_type_names[s_seq.selected_chord_type]);
                }
            }
            /* No sound on sequencer grid pads — step-toggle only */
        }
    }
    else if (s_seq.mode == SEQ_MODE_FIELD) {
        /* Melodic field mode - all rows 1-8, cols 1-6 only (cols 7-8 disabled) */
        if (lp_is_grid(row, col) && col <= 6) {
            uint8_t note = get_field_note(row, col, &s_seq.harmonic);
            /* Quantize: if this pad is off (not lit), redirect to nearest lower lit note */
            note = field_quantize(note);

            /* Track the (possibly redirected) note for release */
            int pad_idx = (row - 1) * 8 + (col - 1);
            if (pad_idx >= 0 && pad_idx < 64) {
                s_seq.field_notes[pad_idx].note = note;
                s_seq.field_notes[pad_idx].active = true;
            }
            
            /* Scale velocity by harmonic role:
             *   chord tone (root/other) → full pad velocity
             *   scale tone (yellow)     → 66 %
             *   tension tone (orange)   → 33 % */
            uint8_t score = score_note(note, &s_seq.display_harmonic);
            uint8_t play_vel;
            if (score >= 200) {
                play_vel = velocity;               /* chord tone → full */
            } else if (score >= 120) {
                play_vel = (uint8_t)((velocity * 2 + 2) / 3);   /* ~66 % */
            } else {
                play_vel = (uint8_t)((velocity + 2) / 3);        /* ~33 % */
            }
            if (play_vel < 1) play_vel = 1;

            dexed_raw_handle_midi(0x90, note, play_vel);
            ESP_LOGD(TAG, "Field: note=%d (%s) score=%d vel=%d",
                     note, note_names[note % 12], score, play_vel);
        }
    }

    /* Refresh display */
    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

void step_seq_handle_grid_release(uint8_t row, uint8_t col)
{
    /* Send Note Off for auditioned sounds */
    if (s_seq.mode == SEQ_MODE_DRUM || s_seq.mode == SEQ_MODE_BOTH) {
        if (lp_is_q3(row, col)) {
            int drum = q3_to_drum_index(row, col);
            if (drum >= 0 && drum < SEQ_NUM_DRUM_TRACKS) {
                seq_drum_note_off(drum_midi_notes[drum]);
            }
        }
    }
    else if (s_seq.mode == SEQ_MODE_MELODIC) {
        if (lp_is_q3(row, col) || lp_is_q4(row, col)) {
            uint8_t base = s_seq.base_octave * 12;
            int offset;
            if (col <= 4) {
                offset = (row - 1) * 4 + (col - 1);
            } else {
                offset = 16 + (row - 1) * 4 + (col - 5);
            }
            uint8_t note = (uint8_t)(base + offset);
            if (note <= 127) {
                dexed_raw_handle_midi(0x80, note, 0);
            }
        }
    }
    else if (s_seq.mode == SEQ_MODE_CIRCLE) {
        /* Rows 1-4 are hold-while-pressed — stop recorded notes on release */
        if (row <= 4 && s_circle_lower_hold.note_count > 0) {
            for (int i = 0; i < s_circle_lower_hold.note_count; i++)
                dexed_raw_handle_midi(0x80, s_circle_lower_hold.notes[i], 0);
            s_circle_lower_hold.note_count = 0;
        }
        /* Rows 5-8 are step-toggle only — no sound to stop */
    }
    else if (s_seq.mode == SEQ_MODE_FIELD) {
        /* Release note when pad released (cols 7-8 are inactive, no-op) */
        if (lp_is_grid(row, col) && col <= 6) {
            int pad_idx = (row - 1) * 8 + (col - 1);
            if (pad_idx >= 0 && pad_idx < 64 && s_seq.field_notes[pad_idx].active) {
                uint8_t note = s_seq.field_notes[pad_idx].note;
                dexed_raw_handle_midi(0x80, note, 0);
                s_seq.field_notes[pad_idx].active = false;
            }
        }
    }
}

